package com.cityu.foodcaptain.constants;

public class Constants {
    public static final String FRESH = "food-service//src//main//resources//db//fresh";
    public static final String RECIPE = "food-service//src//main//resouraces//db//recipe";
    public static final String ROUTER = "food-service//src//main//resources//db//router";
    public static final String CART = "food-service//src//main//resources//dba//cart";

    public static final String SPLIT = "#";
    public static final String RECIPE_SPLIT = "##";

    public static final String FRESH_DATA = "1#崇明毛豆 500g#md1.jpeg#7.90#基地直供|豆荚饱满|炒煮皆宜#蔬菜瓜豆#毛豆#237#115\n" +
            "2#皱皮青椒 300g#qj.jpeg#1.50#鲜香浓郁|个头偏大|小料必备#蔬菜瓜豆#青椒#667#35\n" +
            "3#优质番茄#t1.jpeg#2.50#酸甜多汁|新鲜圆润|质地柔嫩#蔬菜瓜豆#番茄#654#98\n" +
            "4#毛山西红柿#t2.jpeg#3.70#基地直供|个头偏大|质地饱满#蔬菜瓜豆#番茄#236#41\n" +
            "5#李记生抽 500ml#jy1.jpeg#8.9#少盐多鲜|厨房常备|知名品牌#粮油调味#生抽#14#60\n" +
            "6#镇江香醋 500ml#cu1.jpeg#4.8#百年品牌|清爽开胃|知名品牌#粮油调味#醋#14#60\n" +
            "7#山西老陈醋 500ml#cu2.jpeg#17.9#高温灭菌|厨房常备|知名品牌#粮油调味#醋#14#60\n" +
            "8#海天生抽 500ml#jy2.jpeg#6.9#少盐多鲜|厨房常备|知名品牌#粮油调味#生抽#14#60\n" +
            "9#味极鲜特级生抽 750ml#jy3.jpeg#14.9#少盐多鲜|厨房常备|知名品牌#粮油调味#生抽#14#60\n" +
            "10#李记老抽 750ml#jy4.jpeg#11.9#少盐多鲜|厨房常备|知名品牌#粮油调味#老抽#14#60\n" +
            "11#特级老抽 700ml#jy5.jpeg#12.9#少盐多鲜|厨房常备|知名品牌#粮油调味#老抽#14#60\n" +
            "12#味极鲜一品老抽 700ml#jy6.jpeg#8.9#少盐多鲜|厨房常备|知名品牌#粮油调味#老抽#14#60\n" +
            "13#葵花子油 1.8L#o1.jpeg#29.9#物理压榨|油色清亮|煎炒皆宜#粮油调味#食用油#44#90\n" +
            "14#稻米油 900ml#o2.jpeg#25.9#物理压榨|油色清亮|煎炒皆宜#粮油调味#食用油#44#90\n" +
            "15#橄榄油 750ml#o3.jpeg#49.9#物理压榨|油色清亮|煎炒皆宜#粮油调味#食用油#44#90\n" +
            "16#精炼大豆油 5L#o4.jpeg#69.9#物理压榨|油色清亮|煎炒皆宜#粮油调味#食用油#44#90\n" +
            "17#香葱 50g#c1.jpeg#0.65#有机种植#蔬菜瓜豆#葱#44#90\n" +
            "18#小葱 50g#c2.jpeg#0.45#有机种植#蔬菜瓜豆#葱#44#90\n" +
            "19#有机生姜 150g#j1.jpeg#6.5#有机种植#蔬菜瓜豆#姜#44#90\n" +
            "20#有机大蒜 100g#s1.jpeg#3.5#有机种植#蔬菜瓜豆#蒜#44#90\n" +
            "21#冷鲜猪肉 300g#p1.jpeg#14.5#新鲜切分|肉质弹嫩#肉禽蛋类#猪肉#243#89\n" +
            "22#实惠带皮五花肉 500g#p2.jpeg#33.5#新鲜切分|肉质弹嫩#肉禽蛋类#猪肉#43#70\n" +
            "23#冷鲜猪梅花肉 250g#p3.jpeg#28.8#新鲜切分|肉质弹嫩#肉禽蛋类#猪肉#24#30\n" +
            "24#冷鲜大里脊 1000g#p5.jpeg#43.2#新鲜切分|肉质弹嫩#肉禽蛋类#猪肉#74#190\n" +
            "25#冷鲜猪大排 260g#p4.jpeg#23.2#红烧油炸新鲜切分|肉质弹嫩#肉禽蛋类#猪肉#74#190\n" +
            "26#扇子骨 300g#p6.jpeg#22.9#新鲜切分|肉质弹嫩#肉禽蛋类#猪肉#74#190\n" +
            "27#严选精品后腿肉 200g#p8.jpeg#21.9#新鲜切分|肉质弹嫩#肉禽蛋类#猪肉#74#190\n" +
            "28#冷鲜猪排骨 700g#pg1.jpeg#36.9#骨肉相连#肉禽蛋类#排骨#74#190\n" +
            "29#南海冷冻基围虾 300g#xia1.jpeg#25.9#紧实肉质#水产海鲜#虾#14#249\n" +
            "30#冰鲜大头虾 300g#xia2.jpeg#17.9#低温锁鲜|紧实肉质#水产海鲜#虾#14#249\n" +
            "31#冻生巴沙鱼柳 400g#f1.jpeg#12.9#低温锁鲜|紧实肉质#水产海鲜#鱼#14#249\n" +
            "32#有机苹果 200g#a1.jpeg#12.5#有机种植#缤纷水果#苹果#44#90\n" +
            "33#新鲜烘焙圆面包 200g#b1.jpeg#3.5#有机种植#乳制烘焙#面包#44#90\n" +
            "34#脱脂高钙奶 6盒#m1.jpeg#28.9#优质奶源#乳制烘焙#奶#44#90\n" +
            "35#纯牛奶 12盒#m2.jpeg#32.5#优质奶源#乳制烘焙#奶#44#90\n" +
            "36#法棍面包 130g#b2.jpeg#3.5#有机种植#乳制烘焙#面包#44#90\n" +
            "37#澹庵村安心蛋 18枚#e1.jpeg#21.9#日期新鲜#肉禽蛋类#蛋#74#190\n" +
            "38#草鸡蛋 12枚#e2.jpeg#11.9#个头适中#肉禽蛋类#蛋#74#190\n" +
            "39#家常豆腐 280g#df1.jpeg#7.5#鲜磨豆腐#蔬菜瓜豆#豆腐#44#90\n" +
            "40#进口精品樱桃 360g#yt2.jpeg#34.2#严选精品|有机种植#缤纷水果#樱桃#44#90\n" +
            "41#国产樱桃 800g#yt1.jpeg#89.9#新鲜果园|有机种植#缤纷水果#樱桃#44#90\n" +
            "42#家用料酒 500ml#lj1.jpeg#12.9#色泽清亮|煎炒皆宜#粮油调味#料酒#44#90\n" +
            "43#冷鲜鸡大胸 400g#ji1.jpeg#9.9#有机放养#肉禽蛋类#鸡肉#234#40\n" +
            "44#泰森冷鲜鸡里脊 500g#ji2.jpeg#22.9#谷物饲养|煎炒皆宜#肉禽蛋类#鸡肉#78#174\n" +
            "45#冷鲜鸡肉丁 200g#ji3.jpeg#6.9#肉质鲜嫩|煎炒皆宜#肉禽蛋类#鸡肉#60#14\n";

    public static final String RECIPE_DATA = "1、胡萝卜切丝，青椒洗净去蒂切丝，木耳撕成小块备用。\n" +
            "2、瘦肉洗净切丝，并用盐，胡椒粉，料酒，蛋清，和淀粉上浆腌制10分钟。\n" +
            "3、豆瓣酱一勺，葱姜蒜切末。\n" +
            "4、取小碗，用白糖，香醋，料酒，盐，酱油，少量清水，水淀粉兑成一个芡汁。因为豆瓣酱很盐，口不重的就别放盐了。\n" +
            "5、坐锅倒油，把浆好的肉下锅划散，炒到肉丝变白色移至盘中待用。\n" +
            "6、原锅放少许油，胡罗卜不太容易就要先炒两下，再扒到一边，入豆瓣酱炒香出红油。\n" +
            "7、下葱姜蒜沫和其他配料一起炒熟。\n" +
            "8、下肉丝一起翻炒均匀。\n" +
            "9、最后一步倒入兑好的小碗汁炒均匀，出锅。#1#鱼香肉丝#yxrs.jpeg#川菜#249#鱼香肉丝是鱼香菜中最为典型的标志性美味，以其红亮色泽、咸甜带辣微酸的味道征服了所有的食用者，没有食用过此菜的人恐怕不多。但是，如此深受喜爱的中华美食却被好多人做得走了样。这介绍正宗鱼香肉丝的制作方法。\n" +
            "#猪肉,300克|笋,40克|木耳,100克|胡萝卜,100克|尖椒,50克|葱,10克|姜,10克|蒜,10克|盐,5克|豆瓣酱,15克|鸡粉,3克|老抽,10克|生抽,10克|香醋,10克|味精,3克|胡椒粉,5克|料酒,10克|白糖,10克|淀粉,15克\n" +
            "##\n" +
            "1、可用鸡胸脯肉切丝，放入适量盐、糖、老抽、蚝油、淀粉，搅拌均匀。腌制的同时，准备其他食材。超好吃的鱼香肉丝（做法相当简单，一看就会）的做法 步骤1\n" +
            "2、将红萝卜\uD83E\uDD55青椒、木耳切丝备用。超好吃的鱼香肉丝（做法相当简单，一看就会）的做法 步骤2\n" +
            "3、调个料汁，放一勺蚝油，两勺糖，三勺醋，一勺生抽，一勺淀粉，搅拌均匀，待用。\n" +
            "4、热锅加油，将肉丝滑入锅中，翻炒七分熟盛碗备用。此步我忘记拍照了\uD83D\uDCF7\n" +
            "5、热锅加油，放入郫县豆瓣酱炒一下再放入红萝卜、青椒、木耳爆炒几下（有小朋友吃可以不加郫县豆瓣酱，可以替换成番茄酱），然后将炒好的肉丝倒入锅中，翻炒均匀，放入调好的料汁，收汤盛盘。超好吃的鱼香肉丝（做法相当简单，一看就会）的做法 步骤5\n" +
            "6、味道鲜美的鱼香肉丝就出锅了，真的很好吃哦，很下饭的一道菜！#2#鱼香鸡丝#yxjs.jpeg#川菜#249#鱼香鸡丝是鱼香菜中最为典型的标志性美味，以其红亮色泽、咸甜带辣微酸的味道征服了所有的食用者，没有食用过此菜的人恐怕不多。但是，如此深受喜爱的中华美食却被好多人做得走了样。这介绍正宗鱼香肉丝的制作方法。\n" +
            "#鸡肉,300克|冬笋,40克|木耳,100克|胡萝卜,100克|尖椒,50克|葱,10克|姜,10克|蒜,10克|盐,5克|豆瓣酱,15克|鸡粉,3克|老抽,10克|生抽,10克|香醋,10克|味精,3克|胡椒粉,5克|料酒,10克|糖,10克|淀粉,15克\n" +
            "##\n" +
            "1、排骨洗净，糖醋排骨的做法 步骤1\n" +
            "2、锅中倒入冷水，放排骨煮开后捞出沥干备用。糖醋排骨的做法 步骤2\n" +
            "3、锅内倒入适量的油和冰糖①糖醋排骨的做法 步骤3\n" +
            "4、中火加热至变成焦糖色，转小火。千万不要炒过头，不然发黑发苦。（换锅子不为啥，就是铁锅操作的时候，忘记拍照片了。过程和做法是一样，展示一下而已。）糖醋排骨的做法 步骤4\n" +
            "5、倒入排骨快速翻炒上色。（此步骤为炒糖色儿，为了上色更好看。）倒入排骨的时候，可以用锅盖挡一挡，防止油迸到身上。糖醋排骨的做法 步骤5\n" +
            "6、转中大火，依次倒入料酒，生抽，老抽，冰糖②，白醋 和生姜片翻炒出香气。            很多人问醋呢？醋在这一步啊！！这里这里这里啊！！麻烦仔细看步骤啊！！！糖醋排骨的做法 步骤6\n" +
            "7、准备好八角香叶 （你要是不想放，那就不放。看个人喜好，真不用太纠结。家里做菜灵活操作嘛(๑°⌓°๑)不用照搬，也没人逼你。）糖醋排骨的做法 步骤7\n" +
            "8、倒入适量的热水没过排骨，放入八角香叶和香葱结，煮开后转小火焖30分钟。糖醋排骨的做法 步骤8\n" +
            "9、半小时后，大火收汁。糖醋排骨的做法 步骤9\n" +
            "10、收汁完成，色泽美美哒。糖醋排骨的做法 步骤10\n" +
            "11、香喷喷哒。根据个人喜好收汁，有人喜欢干一点的，有人喜欢汤汁多点的。再尝下咸淡，毕竟品牌不同，生抽啊酱油啊什么的含盐量不一样，淡了就加盐。随意点，不用照搬。糖醋排骨的做法 步骤11\n" +
            "12、出炉后撒炒熟的白芝麻和葱花点缀。#3#糖醋排骨#tcpg.jpeg#江浙菜#878#一直用的这个1:2:3:4比例来做的，在原方子的基础上稍作了点修改。纯记录一下。这道菜色香味俱全，非常受欢迎。\uD83C\uDF1F我用的薄盐生抽，所以加了点老抽上色。如果就是普通生抽，老抽可以不加。\uD83C\uDF1F1茶匙5ml，1汤匙15ml。\uD83C\uDF1F新手不会炒糖色就不要炒了，厨友试过了说上色也挺好的。\n" +
            "#排骨,500g|冰糖,约15~20g|料酒,1汤匙|生抽,2汤匙|醋,4汤匙|老抽,1茶匙|八角,1粒|香叶,2小片|葱,1结|姜,3片\n" +
            "##\n" +
            "1、胡萝卜小丁，或者马蹄小丁，香菇，杏鲍菇切细末。葱姜切细末。拌入肉末中。四喜丸子（红烧狮子头）的做法 步骤1\n" +
            "2、加入所有腌料，顺时拌匀。摔打。四喜丸子（红烧狮子头）的做法 步骤2\n" +
            "3、分成7等份。抓一份肉末，滚圆，双手交替互甩肉圆。上劲！四喜丸子（红烧狮子头）的做法 步骤3\n" +
            "4、表面裹上一层干的玉米淀粉四喜丸子（红烧狮子头）的做法 步骤4\n" +
            "5、油温160度左右下肉圆中小火炸至金黄。四喜丸子（红烧狮子头）的做法 步骤5\n" +
            "6、外皮油亮金黄出锅。四喜丸子（红烧狮子头）的做法 步骤6\n" +
            "7、开始红烧！另起一锅，放少许油，爆一下蒜末，倒入生抽适量，料酒适量，加入热水，下入八角，花椒，桂皮，月桂叶，小心放入肉圆，葱结，糖。大火烧开，小火40-50分钟。调味收汁！四喜丸子（红烧狮子头）的做法 步骤7\n" +
            "8、狮子头先捞出放入盘子中，锅中汤汁大火用玉米淀粉加适量水勾芡。浇在狮子头上，西兰花焯水装饰。撒葱花！#4#狮子头#szt.png#江浙菜#519#四喜丸子！我更喜欢称它红烧狮子头\uD83E\uDD24吃的是情怀，大学食堂最爱的美食\uD83D\uDE02无肉不欢！大颗肉球球\uD83E\uDD24\uD83D\uDE0D松软多汁，红烧酱汁超级下饭！每次央求打菜阿姨多打点汤汁拌饭\uD83D\uDE1A\uD83E\uDD2A\uD83D\uDE0B\n" +
            "#猪肉,600克|胡萝卜,三四只或半根|香菇,3个大|杏鲍菇,3只小|姜,适量|盐,3克|胡椒粉,适量|生抽,1汤匙|老抽,2汤匙|料酒,1汤匙|鸡蛋,一个|淀粉,适量|料酒,适量|生抽,适量|盐,适量|花椒,几粒|八角,2个|桂皮,1块|月桂叶,2片|葱结,两根|水,淹没大半|糖,适量|淀粉,适量\n" +
            "##\n" +
            "1、首先选肉要选肉厚，多层次,肉质紧致的带皮五花猪肉。如何炖出不腻的东坡肉--酒店做法及家庭做法的做法 步骤2\n" +
            "2、将猪肉切成40mmx40mm的方块，并用粗棉绳绑成十字结，扎口朝下。如何炖出不腻的东坡肉--酒店做法及家庭做法的做法 步骤3\n" +
            "3、平底锅内放半碗油，将肉皮朝上，中小火慢慢煎出油脂，取出肉块备用。如何炖出不腻的东坡肉--酒店做法及家庭做法的做法 步骤4\n" +
            "4、取一大砂锅，锅底铺上一张竹篾。（这样防止肉块烧焦）如何炖出不腻的东坡肉--酒店做法及家庭做法的做法 步骤5\n" +
            "5、在锅底垫上香葱及姜片。如何炖出不腻的东坡肉--酒店做法及家庭做法的做法 步骤6\n" +
            "6、将煎好的肉块平铺在锅里。如何炖出不腻的东坡肉--酒店做法及家庭做法的做法 步骤7\n" +
            "7、炒锅内放入80克冰糖及50克清水，小火烧至冰糖溶化。如何炖出不腻的东坡肉--酒店做法及家庭做法的做法 步骤8\n" +
            "8、锅内冒烟，冰糖转为深褐色。如何炖出不腻的东坡肉--酒店做法及家庭做法的做法 步骤9\n" +
            "9、放凉后加入清水50ml,重新加热将糖色煮成褐色糖浆水。如何炖出不腻的东坡肉--酒店做法及家庭做法的做法 步骤10\n" +
            "10、将生抽，老抽，糖浆水，花雕酒50ml加入锅内。如何炖出不腻的东坡肉--酒店做法及家庭做法的做法 步骤11\n" +
            "11、注入清水600ml,水量至猪肉的2/3位置，加盖大火烧开后转小火焖约60分钟。如何炖出不腻的东坡肉--酒店做法及家庭做法的做法 步骤12\n" +
            "12、约30分钟时，将猪肉翻转猪皮朝下继续焖制。约45分钟时再翻转过来，直制水份焖至只剩锅底位置。如何炖出不腻的东坡肉--酒店做法及家庭做法的做法 步骤13\n" +
            "13、将猪肉摆放在大碗内，倒入剩下的汤汁，放入剪开口的红枣，再倒入花雕酒30ml。如何炖出不腻的东坡肉--酒店做法及家庭做法的做法 步骤14\n" +
            "14、锅内烧开水，将肉放上加盖大火蒸60分钟即可。#5#东坡肉#dpr.png#江浙菜#634#东坡肉的特色是色泽红亮，肥肉入口即化，瘦肉瘦而不柴，甜而不腻，酒香扑鼻，怎么做出来？两种做东坡肉的方法，一种是专业酒店的制作方法（略复杂）。一种是普通家庭的制作方法（简单）步骤图里是酒店的做法，过程比较复杂，但味道真的是一级棒！家庭的的做法在最后语言补充。注：绍兴酒是这道菜的一大特色，不过我用的是花雕酒两种做法我都试过了，酒店做法吃起来不油腻。家庭做法虽然也好吃，但比较油腻，必竟太大块肉了。\n" +
            "#猪肉,1000克|姜,4片|葱,50克|冰糖,80克|生抽,70ml|老抽,1/4小匙|料酒,50ml|水,600ml|花雕酒,60ml|红枣,6颗\n" +
            "##\n" +
            "1、鸡腿凉水下锅，放葱姜料酒煮25分钟\uD83D\uDD70️看着就流口水的✿口水鸡✿的做法 步骤1\n" +
            "2、煮熟捞出来放冷水中看着就流口水的✿口水鸡✿的做法 步骤2\n" +
            "3、鸡腿凉了以后切片，我煮了三个鸡腿，摆盘里有点拥挤了，两个正好（我是带着骨头切的，也可以把骨头去掉再切）看着就流口水的✿口水鸡✿的做法 步骤3\n" +
            "4、碗里放蒜末，小米椒两个，花生碎，白芝麻一勺，辣椒油两勺，生抽三勺，醋三勺，盐适量，白糖一勺，香油一勺，花椒油油一勺，然后搅拌均匀备用。看着就流口水的✿口水鸡✿的做法 步骤4\n" +
            "5、这个是鸡腿煮熟以后，先把骨头去掉，然后撕成条或者切成条，再加所有调料拌好的，也挺好吃的\uD83D\uDE0B看着就流口水的✿口水鸡✿的做法 步骤5\n" +
            "6、调好的料汁浇在切好的鸡腿\uD83C\uDF57肉上，撒点香菜做装饰，看到这里有没有流口水啊\uD83E\uDD24？开吃喽\uD83D\uDE1C#6#口水鸡#ksj.png#川菜#451#口水鸡是中国四川传统特色菜肴，属于川菜系中的凉菜，佐料丰富，集麻辣鲜香嫩爽于一身。\"口水鸡\"这名字乍听有点不雅，不过这名字的来历倒却有着文人的温雅。郭沫若在所著《賟波曲》中，有：\"少年时代在故乡四川吃的白砍鸡，白生生的肉块，红殷殷的油辣子海椒，现在想来还口水长流……。\"烹调赐拈来\"口水\"两字，倒成就了大名鼎鼎的\"口水鸡\"。\n" +
            "#鸡肉,700g|生抽,3勺|醋,3勺|蒜,4瓣|姜,3片|芝麻,1勺|花生,1勺|糖,1勺|料酒,2勺|盐,适量|葱,半根|小米椒,2个|食用油,2勺\n" +
            "##\n" +
            "1、鸡腿洗净切成小丁（我去了骨头 因为家里刀不行\uD83D\uDE02）放料酒 生抽 盐 姜末 五香粉腌制四小时 让鸡肉充分腌制入味 这个步骤盐一定要放够 不然后面再加盐是入不了味的重庆辣子鸡的做法 步骤1\n" +
            "2、锅里倒入油 能淹过鸡腿丁的量 烧热后 放入鸡腿丁重庆辣子鸡的做法 步骤2\n" +
            "3、炸至金黄捞出 这个步骤大家可以根据自己喜欢的程度来操作 我本人是比较喜欢炸得干一点的 不过考虑到给朋友寄出得花两天时间 可能会越变越干 所以这次没有炸到很干重庆辣子鸡的做法 步骤3\n" +
            "4、锅里留油 先放入蒜末花椒炒香 再放入干辣椒炒出辣味 注意观察火候 别把辣椒炒糊 后面放入鸡腿丁还要炒一会 所以炒到图中的颜色就可以了重庆辣子鸡的做法 步骤4\n" +
            "5、放入鸡腿丁翻炒 将辣味炒入鸡腿丁 最后加少许白糖调味 再撒上一把芝麻 这个时候 闻到香味你一定会流口水 我就是这样\uD83D\uDE02\uD83D\uDE02\uD83D\uDE02重庆辣子鸡的做法 步骤5\n" +
            "6、这次炒了16个鸡腿 所以 就是这么大一盆\uD83D\uDE02 锅都差点炒不下\uD83D\uDE04重庆辣子鸡的做法 步骤6\n" +
            "7、辣椒大家根据自己能接受的程度开放啊 毕竟不是人人都有重庆妹子能吃辣 不过这道菜如果不辣也就不是辣子鸡了\n" +
            "8、每次和番茄爸吃都会有种停不下来的感觉 越吃越想吃#7#辣子鸡#lzj.png#川菜#121#辣子鸡算得上重庆的特色菜了 重庆人都知道歌乐山的辣子鸡是重庆最好吃的辣子鸡 有次外地的朋友来重庆 带她去吃了一次歌乐山辣子鸡 她一直对辣子鸡的味道念念不忘 今天炒了一大盆\uD83D\uDE02等会打包给她寄去 满足她对辣子鸡的思念\uD83D\uDE04\n" +
            "当然 除了我朋友 我本人也是非常爱这道菜 番茄爸也爱 已经连续吃了两天辣子鸡面了\uD83D\uDE02\n" +
            "#鸡肉,700g|辣椒,200克|花椒,适量|姜,一块|蒜,三个|盐,适量|料酒,适量|糖,20克|芝麻,适量|生抽,适量|五香粉,适量\n" +
            "##\n" +
            "1、准备肉末，嫩豆腐切小方块，葱蒜姜末都准备好，忘了拍了，还有淀粉要用点水搅拌成水粉最最简单的麻婆豆腐的做法 步骤1\n" +
            "2、锅里倒点油，五成热就可以加入肉末炒，火不要太大，快速炒不让肉末粘连在一起（没有肉末不放也可以）最最简单的麻婆豆腐的做法 步骤2\n" +
            "3、肉末炒散加入葱蒜姜末，加一勺郫县豆瓣酱，小火继续炒最最简单的麻婆豆腐的做法 步骤3\n" +
            "4、豆瓣酱要炒出红油，记得加点料酒去腥，加一点生抽增香最最简单的麻婆豆腐的做法 步骤4\n" +
            "5、酱炒出香味加小半碗水，加入豆腐，大火煮开，中火炖一下入味最最简单的麻婆豆腐的做法 步骤5\n" +
            "6、豆腐放入锅中一点要拿锅铲轻轻推两下就行，尽量不要翻动免得豆腐太嫩容易碎，豆腐炖几分钟就入味了，加盐，一点点，因为豆瓣酱已经够咸，加糖一点点提味，再加一点花椒粉味就调好了最最简单的麻婆豆腐的做法 步骤6\n" +
            "7、出锅前勾芡，勾芡的时候千万不要一次把芡汁到进去，要分三次一点一点加，加一点芡汁推一推锅，再加，再推，觉得汁已经挂上了就可以了出锅了最最简单的麻婆豆腐的做法 步骤7\n" +
            "8、盛到盘子里，喜欢吃麻的可以再撒点麻椒粉，我是撒了麻椒粉、葱花，感觉味道十足！#8#麻婆豆腐#mpdf.png#川菜#960#冬季少不了麻辣过瘾的川味，出着汗，停不了口，好不快活。麻婆豆腐是川菜中经济实惠又超美味的一道菜，豆腐、豆瓣酱、花椒、牛肉糜简单食材成就一道川味经典，就着一碗白米饭，一勺一勺太过瘾了哦，一边哈着舌头释放麻辣，一边来口冰可口可乐，畅爽好喝，让美食更带劲，痛快！\n" +
            "#豆腐,1块|猪肉,30克|豆瓣酱,1勺|花椒,20粒|花椒粉,4克|葱,1根|淀粉,半勺|料酒,1勺|糖,5克|生抽,1勺\n" +
            "##\n" +
            "1、500g小河虾洗净，用剪刀剪去虾须和虾枪。步骤1\n" +
            "2、一小块姜切丝、3瓣大蒜切末、一小把小葱切段备用。【油爆虾】的做法 步骤2\n" +
            "3、碗里放入4勺美极鲜、2勺糖、2勺水和15g玫瑰露酒调成酱汁备用。\n" +
            "4、*美极鲜可用生抽代替，玫瑰露酒可用料酒代替，但风味会有些许差别。【油爆虾】的做法 步骤3\n" +
            "5、锅中倒入能够没过虾的油，油温烧至160度后放入沥干了水分的小河虾，炸至金黄捞出，再将油温烧至180度，放入小河虾复炸30秒至表面酥脆，捞出沥油备用。\n" +
            "6、*复炸可以使虾壳和虾肉分离开，口感外酥里嫩。【油爆虾】的做法 步骤4\n" +
            "7、锅中留少许油，放入姜丝和蒜末爆香，倒入调味酱汁烧开后，放入葱段和炸好的虾，不断翻炒30秒左右。【油爆虾】的做法 步骤5\n" +
            "8、待酱汁收干，虾的颜色呈油亮金黄即可关火，出锅装盘，油爆虾完成！#9#油爆虾#ybx.png#江浙菜#557#油爆虾是江浙一带的名菜，做法偏甜口，不能想象把菜做甜的同学，先别害怕！其实我也不爱吃甜，但在油爆虾面前仍欢脱得停不下来。小河虾炸过之后特别酥脆，带壳也好吃，满嘴嘎嘣脆。我相信每个江浙长大的孩子，都会用生命来安利油爆虾：）\n" +
            "#虾,500g|姜,一小块|蒜,3瓣|葱,一小把|老抽,4勺|糖2勺|水,2勺|料酒,15g\n" +
            "##\n" +
            "1、先将肉入冷水锅，放入姜片，到一大勺料酒，大火将水烧开，然后转中火，煮半小时左右。回锅肉的做法 步骤1\n" +
            "2、等到用筷子戳进去能扎得透，且没有血水流出，即可关火。回锅肉的做法 步骤2\n" +
            "3、将煮好的肉晾凉，切成薄片，这里是考验刀工的地方啦，太薄了，一炒就碎，太厚了，炒不出灯盏窝儿。（可以放到冷冻室里急冻个五分钟，这样比较好切）回锅肉的做法 步骤3\n" +
            "4、将青蒜斜刀切成寸长段。回锅肉的做法 步骤4\n" +
            "5、炒锅倒油，大火将锅烧热，将切好的肉片下锅，翻炒至肉片卷曲，肥肉透明最好，这样猪肉的油都被炒出来了，吃起来不腻。回锅肉的做法 步骤5\n" +
            "6、然后把肉推动锅的一边，倒入花椒粒，豆瓣酱翻炒，等看到油的颜色变红，就可以把肉扒拉过来炒匀了。回锅肉的做法 步骤6\n" +
            "7、倒入青蒜，料酒、盐、糖、生抽，翻炒均匀即可。#10#回锅肉#hgr.png#川菜#79#回锅肉，就不用介绍了吧，四川人家家会做啊，我觉得普及程度应该跟番茄炒蛋差不多吧，听说川菜厨子考试第一道菜就是回锅肉呢。至于评判标准呢，听说是两个：一是肉片下锅爆炒，必须熬至肉片呈茶船状，成都人说：“熬起灯盏窝儿了”；二是肉片的大小是筷子夹起时会不断抖动。达不到上述两个标准， 必是失败的回锅肉。所以按照这个标准，小羽这道菜一定考试不会过关了。\n" +
            "#猪肉,200克|蒜,2颗|花椒,20粒左右|姜,7、8片|豆瓣酱,2大勺|料酒,2大勺|糖,1大勺|盐,1小勺|生抽,1大勺";
}
